{
 "wiki": "vampirediaries.fandom.com",
 "infobox": "Template:Relationship",
 "parameters": {
  "image": {
   "_not_set_in": 0,
   "_set_in": 50,
   "Elena and Stefan": "Tumblr_noe6pakQwq1uvn68ro6_250.gif\n",
   "Stefan and Damon": " Stefan-Damon-816.gif\n",
   "Alaric and Jenna": " Jalarickforever.gif\n",
   "Damon and Caroline": " Damon-Caroline-816.gif\n",
   "Jeremy and Anna": " Tumblr ltul68eJXE1qfsiino1 500.png\n",
   "Elena and Matt": " Matt and Elena 6x21.gif\n",
   "Elena and Damon": " Elena-Damon-816.gif\n",
   "Jeremy and Vicki": " Tumblr_lbfc5wgN0A1qedzelo1_500.png\n",
   "Caroline and Matt": " Matt_caroline.gif\n",
   "Tyler and Vicki": " 816-164-Tyler-Vicki.png\n",
   "Stefan and Caroline": " Stefan-Caroline-615.gif\n",
   "Pearl and Anna": " Annaandpearlhugging.gif\n",
   "Elena and Katherine": " Elenakat5x11.gif\n",
   "Jeremy and Bonnie": " Beremykiss.gif\n",
   "Elena and Bonnie": " 8x16 I Was Feeling Epic-Bonnie-Elena.jpg\n",
   "Damon and Rose": " rose_and_damon_season2.gif\n",
   "Luka and Bonnie": " Bonnie-and-luka.jpg\n",
   "Elena and Caroline": " Caroline and Elena 6x21.gif\n",
   "Caroline and Tyler": " 122853_600.gif\n",
   "Elena and Jeremy": " Elena and Jeremy 6x21.gif\n",
   "Stefan, Katherine, and Damon": " Damon_stefan_katherine_1x06_jobb.gif\n",
   "Stefan, Elena, and Damon": " VD6 Trio.png\n",
   "Elena, Caroline and Bonnie": " Tumblr_nodtwfqPVY1u5xk74o6_r1_250.gif\n",
   "Stefan and Katherine": " Steferine-katherine-and-stefan-24213162-500-283.gif\n",
   "Caroline and Bonnie": " Baroline.jpeg\n",
   "Damon and Katherine": " Tumblr n6w1u3SEIF1s1qvmko8 250.gif\n",
   "Elena and Elijah": " eleijahkiss.gif\n",
   "Tyler and Matt": " Tylermatt.gif",
   "Jeremy and Tyler": " jyler.gif\n",
   "Damon and Alaric": " Anigif damon alaric 7x01 cheers.gif\n",
   "Damon and Bonnie": " [[File:Damon-Bonnie-810.gif|thumb]]\n",
   "Elijah and Katherine": " Tumblr n809s4avTX1t9x7too7 250.gif\n",
   "Klaus and Katherine": " Klaus_katherine.gif\n",
   "Damon and Jeremy": " Damonjeremy6x14.gif\n",
   "Elena, Jeremy and Jenna": " Normal 0420.jpg\n",
   "Stefan and Klaus": " Tvd-to crossover sk2.jpg\n",
   "Damon and Andie": " Andiedamon.png\n",
   "Elena and Jenna": " Elena_jenna.gif\n",
   "Damon and Isobel": " A34a6a.jpg",
   "Katherine and Mason": " Katherine_mason_2x06.gif\n",
   "Elena and Klaus": " Klaus_elena_3x21.gif\n",
   "Klaus and Alaric": " KlausAlaric.jpeg\n",
   "Katherine and Caroline": " ElenaCar.png\n",
   "Stefan and Rebekah": " HottieStebekah0.gif\n",
   "Damon and Elizabeth": " Damon_liz.gif\n",
   "Stefan and Lexi": " Stefan and Lexi-816.gif \n",
   "Jeremy and Matt": " Jett.gif\n",
   "Damon and Elijah": " 3x13-Stills-Elijah-Damon-infobox-portrait.jpg\n",
   "Stefan and Elijah": " ImagesCA6X2SL1.jpg\n",
   "Damon and Klaus": " 4x03-03.jpg\n"
  },
  "caption1": {
   "_not_set_in": 50,
   "_set_in": 0
  },
  "name": {
   "_not_set_in": 0,
   "_set_in": 50,
   "Elena and Stefan": " Elena and Stefan\n",
   "Stefan and Damon": " Stefan and Damon\n",
   "Alaric and Jenna": " Alaric and Jenna\n",
   "Damon and Caroline": " Damon and Caroline\n",
   "Jeremy and Anna": " Jeremy and Anna\n",
   "Elena and Matt": " Elena and Matt\n",
   "Elena and Damon": " Elena and Damon\n",
   "Jeremy and Vicki": " Jeremy and Vicki\n",
   "Caroline and Matt": " Caroline and Matt\n",
   "Tyler and Vicki": " Tyler and Vicki\n",
   "Stefan and Caroline": " Stefan and Caroline\n",
   "Pearl and Anna": " Pearl and Anna\n",
   "Elena and Katherine": " Elena and Katherine\n",
   "Jeremy and Bonnie": " Bonnie and Jeremy\n",
   "Elena and Bonnie": " Elena and Bonnie\n",
   "Damon and Rose": " Damon and Rose\n",
   "Luka and Bonnie": " Luka and Bonnie\n",
   "Elena and Caroline": " Elena and Caroline\n",
   "Caroline and Tyler": " Caroline and Tyler\n",
   "Elena and Jeremy": " Elena and Jeremy\n",
   "Stefan, Katherine, and Damon": " Stefan, Katherine and Damon\n",
   "Stefan, Elena, and Damon": " Stefan, Elena, and Damon<br />The Main Trio\n",
   "Elena, Caroline and Bonnie": " Elena, Caroline and Bonnie\n",
   "Stefan and Katherine": " Stefan and Katherine\n",
   "Caroline and Bonnie": " Caroline and Bonnie\n",
   "Damon and Katherine": " Damon and Katherine\n",
   "Elena and Elijah": " Elena and Elijah\n",
   "Tyler and Matt": " Matt and Tyler\n",
   "Jeremy and Tyler": " Jeremy and Tyler\n",
   "Damon and Alaric": " Damon and Alaric\n",
   "Damon and Bonnie": " Damon and Bonnie\n",
   "Elijah and Katherine": " Elijah and Katherine\n",
   "Klaus and Katherine": " Klaus and Katherine\n",
   "Damon and Jeremy": " Damon and Jeremy\n",
   "Elena, Jeremy and Jenna": " Elena, Jeremy, and Jenna\n",
   "Stefan and Klaus": " Stefan and Klaus\n",
   "Damon and Andie": " Damon and Andie\n",
   "Elena and Jenna": " Elena and Jenna\n",
   "Damon and Isobel": " Damon and Isobel\n",
   "Katherine and Mason": " Katherine and Mason\n",
   "Elena and Klaus": " Elena and Klaus\n",
   "Klaus and Alaric": " Klaus and Alaric\n",
   "Katherine and Caroline": " Katherine and Caroline\n",
   "Stefan and Rebekah": " Stefan and Rebekah\n",
   "Damon and Elizabeth": " Damon and Liz\n",
   "Stefan and Lexi": " Stefan and Lexi\n",
   "Jeremy and Matt": " Jeremy and Matt\n",
   "Damon and Elijah": " Damon and Elijah\n",
   "Stefan and Elijah": " Stefan and Elijah\n",
   "Damon and Klaus": " Damon and Klaus\n"
  },
  "nickname(s)": {
   "_not_set_in": 5,
   "_set_in": 45,
   "Elena and Stefan": " Stelena, SE, ES",
   "Stefan and Damon": " The Salvatore Brothers, The Salvatore Boys, Defan, Stamon, Stefmon\n",
   "Alaric and Jenna": " Jalaric\n",
   "Damon and Caroline": " Daroline\n",
   "Jeremy and Anna": " Janna\n",
   "Elena and Matt": " Melena, Malena\n",
   "Elena and Damon": " Delena, DE, Dex\n",
   "Jeremy and Vicki": " Jicki\n",
   "Caroline and Matt": " Maroline\n",
   "Tyler and Vicki": " Ticki\n",
   "Stefan and Caroline": " Steroline, SC, CS\n",
   "Elena and Katherine": " Kelena, Kalena, Katlena, Giltrova\n",
   "Jeremy and Bonnie": " Beremy, Jonnie\n",
   "Elena and Bonnie": " Belena, Bonlena, Elonnie\n",
   "Damon and Rose": " Damose, Ramon\n",
   "Luka and Bonnie": " Lonnie\n",
   "Elena and Caroline": " Carena\n",
   "Caroline and Tyler": " Forwood, Tyroline, Taroline\n",
   "Elena and Jeremy": " Jelena",
   "Stefan, Katherine, and Damon": " Steferine, Datherine, Defan",
   "Stefan, Elena, and Damon": " Delena, Stelena, Defan",
   "Elena, Caroline and Bonnie": " Barolena",
   "Stefan and Katherine": " Steferine, Stefarine, Statherine, SK\n",
   "Caroline and Bonnie": " Baroline, Connie\n",
   "Damon and Katherine": " Datherine, Kamon, Damatherine, Damtherine, DamKat, Dath, Kathmon, Katmon\n",
   "Elena and Elijah": " Elejah, Elenijah\n",
   "Tyler and Matt": " Myler\n",
   "Jeremy and Tyler": " Jyler\n",
   "Damon and Alaric": " Dalaric\n",
   "Damon and Bonnie": " Bamon, Donnie, Bonnie and Clyde <small>(By Damon)</small>\n",
   "Elijah and Katherine": " Kalijah\n",
   "Klaus and Katherine": " Klatherine, Klautherine\n",
   "Damon and Jeremy": " Deremy, Daremy, Jamon\n",
   "Stefan and Klaus": " Klefan\n",
   "Damon and Isobel": " Damobel, Isamon, Isomon\n",
   "Katherine and Mason": " Kason\n",
   "Elena and Klaus": " Klena\n",
   "Katherine and Caroline": " Catherine, Fierce, Karoline, Katholine, Cartherine",
   "Stefan and Rebekah": " Stebekah\n",
   "Damon and Elizabeth": " Delizabeth\n",
   "Stefan and Lexi": " Stexi, Lexfan, Sexi\n",
   "Jeremy and Matt": " Meremy, Jett\n",
   "Damon and Elijah": " Delijah, Eamon\n",
   "Stefan and Elijah": " Stejah, Elifan",
   "Damon and Klaus": " Klamon"
  },
  "intimacy levels": {
   "_not_set_in": 0,
   "_set_in": 50,
   "Elena and Stefan": " Dated, Sexual, Loved each other; Close Friends, Former Allies; Stefan saw Elena as his soulmate before he fell in love with Caroline, Elena called Stefan one of her two epic loves, Protective of one another, Cared deeply about one another, Stefan has always respected Elena's decisions, Stefan asked Elena to bring his humanity back, They knew each other better than anyone, They became family (brother and sister-in-law) since Elena married Stefan's brother.\n",
   "Stefan and Damon": " Family, Brothers, Former Allies, Best Friends, Former Enemies, Former Rivals; Love each other, Protective of one another, Care about each other, Both have sacrificed their lives for each other, They have a bad history together mostly due to their previous [[Elena and Katherine|lovers]] but they eventually moved on from that, Stefan tried to save Damon from [[Sybil]] and it worked, Both were servants to [[Arcadius|Cade]] but they overcame his powers.",
   "Alaric and Jenna": " Dated, Sexual, Loved each other; Close Bond, Former Allies; They were protective of each other, Alaric kept the secret of [[vampire]]s away from Jenna to try and keep her safe, Alaric still loves her and still mourns her death.\n",
   "Damon and Caroline": " Family, Brother/Sister-in-Law; Close Friends, Family, Frenemies, Former Enemies; Dated (while Caroline was compelled), Sexual; Damon's blood turned Caroline into a vampire, Caroline resented Damon for compelling her to date him, Damon used Caroline as a feeding/blood source when she was human, Damon teases Caroline often when they interact (which annoys her), They found common ground and grew closer in friendship during [[Elizabeth Forbes]]' funeral.",
   "Jeremy and Anna": " Dated, Sexual; Former Allies, They were in love with each other, Jeremy chose Anna over Bonnie when the [[The Other Side|Other Side]]'s wall was lowered, Jeremy cheated on Bonnie with Anna's [[ghost]], Anna initially only saw Jeremy as a tool to get her [[Pearl|mother]] back but she grew to truly care for him.\n",
   "Elena and Matt": " Exes, Sexual <small>(Possibly/Reference to [[Caroline Forbes|Caroline]]'s quote that they were each other's firsts)</small>; Best Friends, Former Enemies, Former Allies; Were First Loves, Care About Each Other, Love each other (as friends); Matt was Elena's humanity trigger when she was a vampire.\n",
   "Elena and Damon": " Married; Husband and Wife (Flash-forward), Sexual; They believe to be each other's Soulmates; In Love, They are the love of each other's lives, Elena is his life, They have a future together, Passionate feelings; Best Friends, Former Enemies, Allies; Elena fell for Damon all over again even after losing her memories of loving him, Protective of each other, Damon is always there for her, Elena has never abandoned him, Damon will always choose her, Can't live without each other, Elena is the only one who thought Damon was worth loving, Elena chose Damon over [[Stefan Salvatore|Stefan]].",
   "Jeremy and Vicki": " Sexual, Dated; They had romantic feelings for each other, Jeremy loved Vicki, Vicki didn't want to be tied down by Jeremy; Former Friends, Former Allies; Jeremy silenced Vicki out when she tried [[Medium|contacting]] him as a ghost (This effectively ended their relationship, permanently).\n",
   "Caroline and Matt": " Exes, Sexual, They were in love with each other; Allies, Good Friends; Matt broke up with Caroline because she is a [[vampire]], They worked together to stop their enemies throughout the series.",
   "Tyler and Vicki": " Dated, Sexual; Ex-Friends, Former Frenemies; They were physically attracted to one another, Tyler used Vicki while they were dating (he didn’t genuinely care for her at first), Vicki liked Tyler’s personality, Tyler mourned Vicki’s death, They both found peace in death together.\n",
   "Stefan and Caroline": " Were Married, Husband and Wife (Stefan died, leaving Caroline widowed); Best Friends, Former Allies; Sexual, They were in love with each other, Cared about each other, They were willing to start a life together even when Stefan was a [[The Cure|cured]] vampire/human, Caroline will always love Stefan.\n",
   "Pearl and Anna": " Family, Mother/Daughter; Close bond, Former Allies; They love each other, Pearl looked out for her, Anna would do anything for her mother, They found peace with each other in death.\n",
   "Elena and Katherine": " Petrova Doppelgängers, Family, Ancestor/Descendant (Katherine/Elena); Enemies, Former Allies, Former Frenemies; Katherine has tried to kill Elena several times, Elena forced Katherine to become human <small>(in ''[[Graduation (Episode)|Graduation]]'')</small>, Katherine's involvement in Elena's life has been the indirect result of her loved ones' deaths, Elena forgave Katherine on her death bed before Katherine possessed her <small>(in ''[[500 Years of Solitude]]'')</small>, Katherine managed to possess Elena's body and took control over it, Elena hates Katherine for being in her life and blames her for ruining it.\n",
   "Jeremy and Bonnie": " Dated, Sexual, Close Bond; They were in love with each other, Jeremy was Bonnie's first love; Distant Friends, Former Allies; Cared about each other, Bonnie sacrificed her life for [[Elena and Jeremy|Jeremy and his sister]], Jeremy cheated on Bonnie with his deceased [[Annabelle|former girlfriend]] (who was a ghost at the time) and caused their first relationship to end.",
   "Elena and Bonnie": " Best Friends, Like Sisters, Allies, Former Enemies (while Elena's humanity was off); Love each other, Always there for one another, Protective of each other, Bonnie sacrificed her life for [[Elena and Jeremy]], Elena had asked Bonnie to live out her life instead of asking Bonnie to die and awakening her, Bonnie missed Elena while she was in a magical slumber; Their lives used to be linked as long as Bonnie was still alive, They reunited before Bonnie began traveling the world.\n",
   "Damon and Rose": " Ex-Fling, Sexual; Good Friends (Once friends with benefits), They cared about one another, They sympathized with each other, Rose recognized Damon’s love for Elena, Damon grieved Rose’s loss.",
   "Luka and Bonnie": " Ex-Friends, Former Allies; Bonnie cared about Luka (he grew to somewhat care about her), They both related to each other based on the fact that they were witches, Bonnie had a crush on Luka, Luka was just using Bonnie.\n",
   "Elena and Caroline": " Family, Sisters-In-Law; Best Friends, Like Sisters, Former Enemies, Allies; Former college roommates; They love each other, Care about each other, Protective of one another, Caroline had missed Elena deeply when she was under a magical slumber.\n",
   "Caroline and Tyler": " Exes, Sexual, Were in love, Former tension due to Caroline's involvement with [[Niklaus Mikaelson|Klaus]] after their break up; Distant/Good Friends, Former Allies; Cared about each other, Were protective of each other, Tyler was the love of Caroline's life.\n",
   "Elena and Jeremy": " Biological Cousins, Adoptive Siblings, Close Family Bond, Allies; Protective of one another, Love each other, Would do anything for each other, They still consider themselves siblings despite finding out that they are really cousins.\n",
   "Stefan, Katherine, and Damon": " Former Love Triangle, Former Allies, Former Enemies; Katherine was first dating Damon, Katherine wanted to choose Stefan before she died, Katherine loved both of them, Damon now loathes Katherine, Stefan [[Caroline Forbes|moved on]] from Katherine after her death (and before his death). \n",
   "Stefan, Elena, and Damon": " Family, Former Love Triangle; Friends, Former Allies; Elena was in love with and first dating Stefan, Elena chose Damon and married him, Elena and Stefan became Sister/Brother-In-Laws.\n",
   "Elena, Caroline and Bonnie": " Best Friends, Like Sisters, Allies, Former Enemies; Love each other, Protective of one another, Care about one another, They all have been through rough patches in their relationships individually with each other but they all worked it out in the end, Caroline and Elena are sisters-in-law.\n",
   "Stefan and Katherine": " Sexual, Dated; Former Enemies/Allies, Friends/Frenemies; Katherine always [[Stefan, Katherine, and Damon|chose]] Stefan over Damon (even though she loved both [[Stefan and Damon|Salvatore brothers]]), Stefan believed Katherine deserves peace and sympathized with her, Stefan had lingering feelings for Katherine, Stefan was Katherine's one true love, Katherine was still in love with Stefan before she died, Have a complex history together (which halted Stefan from forgiving her right away in [[Season Five]]), Katherine seemed to be over Stefan when she returned as the Queen of Hell when she tried to destroy Mystic Falls.\n",
   "Caroline and Bonnie": " Best Friends, Like Sisters, Allies, Former Enemies <small>(On Bonnie's side only/Bonnie was cursed with [[Rayna Cruz]]'s Supernatural Huntress spell and was hunting Caroline down)</small>; Love and care for each other, Always have each other's backs, They maintained a powerful friendship throughout the series.\n",
   "Damon and Katherine": " Exes, Sexual, Dated, Damon was extremely in love with Katherine, Damon was obsessed with finding Katherine for decades, They loved each other; Former Friends/Frenemies, Former Allies, Enemies; Damon hates Katherine and blames her for who he is today, Damon fed Katherine to [[Silas]] (which caused her to lose the cure and die of old age rapidly), Katherine [[Stefan, Katherine, and Damon|chose]] [[Stefan Salvatore|Stefan]] over Damon.\n",
   "Elena and Elijah": " Former Frenemies, Former Enemies, Former Allies, Distant Friends (Have Kissed); They cared about each other, Elena looked up to Elijah, They have betrayed each other in the past but eventually forgave each other due to their devotion to family (Kissed once; It was meant for [[Katerina Petrova|Katherine]] though).",
   "Tyler and Matt": " Best Friends, Like brothers, Former Allies, Were [[Jeremy, Matt and Tyler|Roommates]], Former Frenemies; They were in the police academy together, They lookEd out for each other, They care about each other, There was tension between them being they were both in love with [[Caroline Forbes]] and with Tyler making out with [[Kelly Donovan|Matt's mother]] at a certain point in the series, Matt grieves Tyler’s death, Tyler chose to briefly watch over Matt (with Vicki) before crossing over into the afterlife.\n",
   "Jeremy and Tyler": " Best Friends, Former Enemies, Former Allies, Were partners against vampires, Were Roommates; Tyler bullied Jeremy when they were in [[Mystic Falls High School|high school]], They both dated [[Vicki Donovan|Vicki]] (which caused their relationship to become antagonistic), They became closer in friendship after Tyler matured into a werewolf, They used to frequently ally together to stop supernatural enemies, They both left [[Mystic Falls]] and hunted vampires together before Tyler's death.\n",
   "Damon and Alaric": " Were Best Friends, Were Like Brothers, Frenemies, Former Allies/Enemies; Cared about each other, Were protective of one another, Had each other's backs, Damon was Alaric's Best Man in his [[Alaric and Jo's wedding|wedding]], Their friendship is severely strained after Damon became the siren's slave and nearly harmed his daughters, Alaric attempted to kill Damon for putting his daughters in harm's way.",
   "Damon and Bonnie": " Best Friends, Former Allies, Former Enemies; Love-Hate relationship, They love each other like siblings, They would sacrifice their lives for each other (they have done so in past actions), Protective of one another, They care about each other, Damon saved Bonnie and let her live instead of letting her die and awakening [[Elena Gilbert|Elena]], Bonnie risked her life to save Damon from [[Arcadius]].\n",
   "Elijah and Katherine": " Ex-Lovers, They had romantic feelings for each other, Sexual; Elijah cared about Katherine, Elijah mistrusted Katherine after all the years of lies she has told him; Former Friends, Former Allies/Enemies.",
   "Klaus and Katherine": " Enemies, Former Rivals, Formerly friendly with each other; They hated each other, Klaus killed Katherine's entire family (she thought that he killed her then-baby [[Nadia Petrova|daughter]]), Katherine spoiled Klaus' plans of his first attempt at the sacrifice to become a [[hybrid]], Klaus wanted to kill Katherine for turning into a vampire behind his back, Klaus chased Katherine for centuries.\n",
   "Damon and Jeremy": " Family, Brothers-In-Law (Damon is married to his [[Elena Gilbert|adoptive sister]]); Friends/Frenemies, Allies, Former Enemies; Love-Hate Relationship, Damon looked out for Jeremy for [[Elena Gilbert|Elena]], They have tried to kill each other (and have succeeded in some cases), Jeremy hated Damon but found common ground with him.\n",
   "Elena, Jeremy and Jenna": "Family, Jenna was their aunt (adoptive aunt to Elena) and [[Elena and Jeremy]] are adoptive siblings, Jenna was their legal guardian before she died; Good Friends, Close Bond, Former Allies; They all cared about each other, They were protective of each other.\n",
   "Stefan and Klaus": " Former Best Friends, Frenemies, Old Friends, Former Allies, Former Enemies; They have known each other for almost a century, Stefan considered Klaus his closest friend back in 1920's, Klaus compelled Stefan to turn his humanity switch off and tried to kill his [[Elena Gilbert|ex-girlfriend]] several times.",
   "Damon and Andie": " Dated, Sexual; Damon compelled Andie to love and care about him, Andie was also compelled to keep his secrets (especially his former-vampire identity), Damon fed off of Andie and her blood regularly when they were together, Former Allies; Damon grew to somewhat care about Andie later on, Damon mourned Andie's death.\n",
   "Elena and Jenna": " Family, Adoptive Aunt and Niece (Jenna/Elena), Jenna was Elena's Legal Guardian (after [[Miranda Sommers-Gilbert]]'s death); Good Friends, Former Allies; They were protective of each other, Close relationship.\n",
   "Damon and Isobel": " Ex-Fling, Sexual; Former Allies, Former Enemies, Frenemies; Damon sired Isobel, Isobel recognized Damon's love for her daughter, They now share an antagonistic relationship <small>(He killed and turned her into a vampire)</small>.\n",
   "Katherine and Mason": " Exes, Sexual, Mason was in love with Katherine (One-Sided; she did not feel the same); Former Allies, Former Partners in Crime; Katherine was just using Mason to get to the [[Moonstone]], Mason didn't trust Katherine. \n",
   "Elena and Klaus": " Former Enemies/Allies; They dislike each other, Klaus is responsible for hurting and killing the ones Elena loves, Elena had no problem taking part in killing Klaus' [[Kol and Finn|brothers]], Klaus killed Elena as a human (the first time), Elena tried to kill Klaus with her [[Mystic Falls Gang|allies]] numerous times, Klaus only saw Elena as a vessel for his hybrid cause and wanted to protect her because he needed her blood.\n",
   "Klaus and Alaric": " Frenemies, Former Enemies/Allies; Klaus possessed Alaric's body, Alaric killed Klaus while he was in his dark phase, Alaric wanted nothing to do with Klaus when his daughters are involved, Their daughters all go to the Salvatore Boarding School.\n",
   "Katherine and Caroline": " Former Enemies/Allies, Frenemies, Former Partners; Katherine killed Caroline and was responsible for turning her into a [[vampire]], Caroline dislikes Katherine.\n",
   "Stefan and Rebekah": " Exes, Sexual; They felt a romantic attraction for each other, They were in love nearly a century ago; Former Enemies, Former Allies, Former Frenemies, Friends; They allied together to get the cure, Stefan went against Rebekah's wishes to get the cure for herself, Stefan was involved with killing Rebekah's [[Kol Mikaelson|brother]] which possibly put a permanent strain on their relationship. \n",
   "Damon and Elizabeth": " Close Friends, Former Enemies/Frenemies, Former Allies; They had a love-hate relationship, They cared about each other, They were protective of each other, Damon considered her to be one of his very few friends, Things between them grew tense after Liz realized he was a [[vampire]] (this is later resolved), Damon flirted with her once but he compelled her to forget their meeting (years ago).\n",
   "Stefan and Lexi": " Best Friends, Allies, Like Siblings, They care about each other, They are like family; Lexi helped and mentored Stefan decades ago out of his [[Ripper]] Phase, They are at peace together in the [[The Bright World|afterlife]].\n",
   "Jeremy and Matt": " Best Friends, Like Brothers, Were [[Jeremy, Matt and Tyler|Roommates]] (with [[Tyler Lockwood|Tyler]]); Allies; They grew up together, They dated each other's [[Elena and Vicki|siblings]], They would do anything for each other.",
   "Damon and Elijah": " Friends/Frenemies, Former Allies/Enemies; They both cared about Elena's safety, Damon liked Elijah better than Klaus.",
   "Stefan and Elijah": " Former Allies, Former Enemies, Distant Friends/Frenemies; Stefan possibly favors him over Klaus\n",
   "Damon and Klaus": " Former Allies/Enemies, Frenemies; Klaus saved Damon from two werewolf bites, They had a lot in common, They were contact with each other after Klaus left for [[New Orleans]]."
  },
  "first met": {
   "_not_set_in": 0,
   "_set_in": 50,
   "Elena and Stefan": " May 23, 2009 (Unofficially/Only Stefan) \nSeptember 7, 2009 (Officially)\n",
   "Stefan and Damon": " November 1, 1846 (Stefan's birth)\n",
   "Alaric and Jenna": " ''[[History Repeating]]''\n",
   "Damon and Caroline": " [[Timeline|September 7, 2009]] <small>(''[[r1x01]]''}</small>\n",
   "Jeremy and Anna": " ''[[Bloodlines]]''\n",
   "Elena and Matt": " Childhood\n",
   "Elena and Damon": " May 23, 2009 (before ''[[Pilot]]'')\n",
   "Jeremy and Vicki": " Childhood <small>(Presumably)</small>\n",
   "Caroline and Matt": " During Childhood\n",
   "Tyler and Vicki": " Presumably since childhood\n",
   "Stefan and Caroline": " September 7, 2009 (''[[Pilot]]'')\n",
   "Pearl and Anna": " When Anna was born\n",
   "Elena and Katherine": " March 4, 2010 <small>(''[[Memory Lane]]'')</small>\n",
   "Jeremy and Bonnie": " Since childhood\n",
   "Elena and Bonnie": " Childhood\n",
   "Damon and Rose": " March 25, 2010 (''[[Rose (Episode)|Rose]]'')\n",
   "Luka and Bonnie": " March 26, 2010 (''[[Katerina]]'')\n",
   "Elena and Caroline": " Childhood\n",
   "Caroline and Tyler": " Childhood\n",
   "Elena and Jeremy": " When [[Jeremy Gilbert|Jeremy]] was born\n",
   "Stefan, Katherine, and Damon": " 1864\n",
   "Stefan, Elena, and Damon": " May 23, 2009 (Before ''[[Pilot]]'') <small>(Damon met her first)</small>\n",
   "Elena, Caroline and Bonnie": " Childhood\n",
   "Stefan and Katherine": " [[Timeline|1864]] - in flashback from  (''[[Lost Girls]]'') - Stefan saw Katherine for the first time, in another flashback from (''[[500 Years of Solitude]]'') Katherine saw Stefan for the first time.\n",
   "Caroline and Bonnie": " Childhood \n",
   "Damon and Katherine": " [[Timeline|1864]]\n",
   "Elena and Elijah": " March 25, 2010 <small>(''[[Rose (Episode)|Rose]]'')</small>\n",
   "Tyler and Matt": " Childhood\n",
   "Jeremy and Tyler": " Most likely childhood.\n",
   "Damon and Alaric": " ''[[Bloodlines]]''\n",
   "Damon and Bonnie": " October 31, 2009 <small>(''[[Haunted]]'')</small>\n",
   "Elijah and Katherine": " In England, 1492 (''[[Klaus (Episode)|Klaus]]'')\n",
   "Klaus and Katherine": " [[Klaus (Episode)|March 1492]], England\n",
   "Damon and Jeremy": " October 31, 2009 (''[[Haunted]]'')\n",
   "Elena, Jeremy and Jenna": " Jeremy's Birth <small>(Possibly)</small>\n",
   "Stefan and Klaus": " [[Timeline|1920's]] <small>(''[[The End of the Affair]]'')</small>\n",
   "Damon and Andie": " April 1, 2010 (''[[Daddy Issues]]'')\n",
   "Elena and Jenna": "When Elena was born.\n",
   "Damon and Isobel": " A little after [[Elena Gilbert|Elena's]] birth\n",
   "Katherine and Mason": " Unknown\n",
   "Elena and Klaus": " April 28, 2010 (''[[The Last Day]]'')",
   "Klaus and Alaric": " ''[[Know Thy Enemy]]''\n",
   "Katherine and Caroline": " February 26, 2010 <small>(''[[The Return]]'')</small>\n",
   "Stefan and Rebekah": " [[Timeline|1922]]\n",
   "Damon and Elizabeth": " *1994 <small>(Damon compelled her to forget the meeting)</small>\n*2009\n",
   "Stefan and Lexi": " [[Timeline|1864]]\n",
   "Jeremy and Matt": " Since Childhood\n",
   "Damon and Elijah": " ''[[Rose (Episode)|Rose]]''\n",
   "Stefan and Elijah": " March 25, 2010 (''[[Rose (Episode)|Rose]]'')\n",
   "Damon and Klaus": " ''[[The Last Day]]''\n"
  },
  "started dating": {
   "_not_set_in": 26,
   "_set_in": 24,
   "Elena and Stefan": " September 9, 2009 (''[[The Night of the Comet]]'')\n",
   "Alaric and Jenna": " ''[[Bad Moon Rising]]''\n",
   "Damon and Caroline": " [[Season One]]\n",
   "Jeremy and Anna": " ''[[Blood Brothers]]''",
   "Elena and Matt": " Before ''[[Pilot]]'' <small>(During their teenage years)</small>",
   "Elena and Damon": " November 29, 2010 ''([[My Brother’s Keeper]])'' <br /> Relationship Confirmed: May 2011 ''([[Graduation (Episode)|Graduation]])''\n",
   "Jeremy and Vicki": " Pre-''[[Pilot]]''\n",
   "Caroline and Matt": " ''[[Unpleasantville]]''\n",
   "Tyler and Vicki": " [[Season One]]\n",
   "Stefan and Caroline": " ''[[Day One of Twenty-Two Thousand, Give or Take]]''",
   "Pearl and Anna": "\n",
   "Jeremy and Bonnie": " ''[[Crying Wolf]]''\n",
   "Caroline and Tyler": " August 23, 2010 (''[[The Birthday]]'')",
   "Elena and Jeremy": "\n",
   "Stefan and Katherine": " [[Timeline|1864]]",
   "Damon and Katherine": " [[Timeline|1864]]",
   "Jeremy and Tyler": "\n",
   "Elijah and Katherine": " Unknown (Possibly sometime during [[Season Three|Season 3]] to [[Season Four|Season 4]])",
   "Klaus and Katherine": "\n",
   "Damon and Andie": " ''[[Daddy Issues]]''\n",
   "Elena and Jenna": "\n",
   "Damon and Isobel": " A little after [[Elena Gilbert|Elena's]] birth\n",
   "Katherine and Mason": " Unknown <small>(Before ''[[Kill or Be Killed]]'')</small>\n",
   "Stefan and Elijah": "\n"
  },
  "status": {
   "_not_set_in": 0,
   "_set_in": 50,
   "Elena and Stefan": " Close Friends, Exes; Family, Brother/Sister-in-law, Ended <small>(Stefan is dead)</small>.\n",
   "Stefan and Damon": " Family, Brothers, Former Allies, Best Friends; Temporarily Separated <small>(Stefan is dead/They find peace in death together in a flashforward.)</small>\n",
   "Alaric and Jenna": " Dated, Former Allies; Ended <small>(Jenna is dead)</small>",
   "Damon and Caroline": " Family, Exes, Allies, Close Friends/Frenemies\n",
   "Jeremy and Anna": " Dated, Former Allies; Ended <small>(Anna is dead)</small>",
   "Elena and Matt": " Exes, Best Friends\n",
   "Elena and Damon": " Married, Best Friends; Ended <small>(Flash-forward; both are dead, found peace)</small>\n",
   "Jeremy and Vicki": " Former Friends, Dated; Ended <small>(Vicki is dead)</small>",
   "Caroline and Matt": " Exes, Allies, Good Friends\n",
   "Tyler and Vicki": " Exes; Ended <small>(Both are dead)</small>\n",
   "Stefan and Caroline": " Widowed <small>(Stefan is dead)</small>\n",
   "Pearl and Anna": " Family, Mother/Daughter; Ended <small>(Both are dead; found peaceref[http://tvline.com/2017/03/11/the-vampire-diaries-series-finale-deleted-scenes-bonnie-ending/ Julie Plec reveals that Pearl and Anna have found peace.]</ref>)",
   "Elena and Katherine": " Family by Blood, Enemies, Former Frenemies; Ended <small>(Katherine is dead)</small>",
   "Jeremy and Bonnie": " Distant Friends, Exes; Separated <small>(Jeremy is back in Mystic Falls, but Bonnie broke up with him via voicemail years ago and is now traveling the world.)</small>\n",
   "Elena and Bonnie": " Best Friends, Like Sisters, Allies; Separated <small>(Bonnie left Mystic Falls and is currently traveling the world.)</small>",
   "Damon and Rose": " Ex-Fling, Good friends; Ended <small>(Rose is dead)</small>\n",
   "Luka and Bonnie": " Ex-Friends, Former Allies; Ended <small>(Luka is dead)<small>",
   "Elena and Caroline": " Best Friends, Sisters-In-Law, Allies; Reunited",
   "Caroline and Tyler": " Exes, Distant/Good Friends, Former Allies; Ended <small>(Tyler is dead)</small>\n",
   "Elena and Jeremy": " Biological Cousins, Adoptive Siblings, Allies\n",
   "Stefan, Katherine, and Damon": " Former Love Triangle, Former Enemies/Allies; Ended <small>(Katherine and Stefan are dead)</small>\n",
   "Stefan, Elena, and Damon": " Family, Former Love Triangle; Ended/Separated <small>(Stefan is dead and Elena is married to Damon)</small>\n",
   "Elena, Caroline and Bonnie": " Best friends, Like Sisters; Separated <small>(Bonnie is currently traveling the world.)</small>\n",
   "Stefan and Katherine": " Dated, Former Friends <small>(Complicated)</small>; Ended <small>(Both are dead)</small>\n",
   "Caroline and Bonnie": " Best Friends, Allies; Separated <small>(Bonnie is currently traveling the world on her own.)</small>\n",
   "Damon and Katherine": " Exes, Former Friends, Enemies; Ended (Katherine is dead)\n",
   "Elena and Elijah": " Distant Friends, Former Allies; Ended <small>(Elijah is dead)</small>\n",
   "Tyler and Matt": " Best Friends, Former Allies; Ended <small>(Tyler is dead)</small>\n",
   "Jeremy and Tyler": " Best Friends, Former Allies; Ended <small>(Tyler is dead)</small>",
   "Damon and Alaric": " Were Best Friends <small>(Strained)</small>, Were Like Brothers, Former Allies/Enemies\n",
   "Damon and Bonnie": " Best Friends, Former Allies; Separated <small>(Bonnie is currently traveling the world & away from Mystic Falls.)</small>",
   "Elijah and Katherine": " Ex-Lovers, Former Allies; Ended <small>(Both are dead)</small>\n",
   "Klaus and Katherine": " Enemies, Former Rivals; Ended <small>(Both are dead)</small>",
   "Damon and Jeremy": " Family (Brothers-In-Law), Friends, Allies",
   "Elena, Jeremy and Jenna": " Family, Good Friends; This trio is permanently separated (until Elena’s death) <small>(Jenna is dead/Elena reunites with Jenna in death in a flash forward.)</small>",
   "Stefan and Klaus": " Former Best Friends, Frenemies/Old Friends; Ended <small>(Both are dead)</small>\n",
   "Damon and Andie": " Dated, Former Allies; Ended <small>(Andie is dead)</small>",
   "Elena and Jenna": "Family, Good Friends; Ended <small>(Jenna is dead/Reunited after their deaths in a flash forward.)</small>",
   "Damon and Isobel": " Exes, Former Enemies; Ended <small>(Isobel is dead)</small> \n",
   "Katherine and Mason": " Exes, Former Allies; Ended <small>(Both are dead)</small>",
   "Elena and Klaus": " Former Enemies/Allies; Ended <small>(Klaus is dead)</small>",
   "Klaus and Alaric": " Frenemies, Former Allies; Ended <small>(Klaus is dead)</small>",
   "Katherine and Caroline": " Frenemies, Former Allies/Enemies; Ended <small>(Katherine is dead)</small>\n",
   "Stefan and Rebekah": " Exes, Friends, Former Allies/Enemies; Ended <small>(Stefan is dead)</small>",
   "Damon and Elizabeth": " Close Friends, Former Allies; Ended <small>(Liz is dead)</small>\n",
   "Stefan and Lexi": " Best friends, Allies; Reunited <small>(Both are dead, but together in the afterlife.)</small>",
   "Jeremy and Matt": " Best friends, Like Brothers, Allies\n",
   "Damon and Elijah": " Friends/Frenemies, Former Allies; Ended <small>(Elijah is dead)</small>",
   "Stefan and Elijah": " Former Allies, Distant Friends/Frenemies; Ended <small>(Both are dead)</small>\n",
   "Damon and Klaus": " Frenemies, Former Allies; Ended <small>(Klaus is dead)</small>\n"
  }
 }
}