{
 "wiki": "vampirediaries.fandom.com",
 "infobox": "Template:TO Relationship",
 "parameters": {
  "image": {
   "_not_set_in": 0,
   "_set_in": 49,
   "Mikael and Klaus": " Miklaus.gif\n",
   "Klaus and Rebekah": " TO-S4-Klaus and Rebekah.gif\n",
   "Elijah and Rebekah": " TO-S4-Elijah and Rebekah.gif\n",
   "Klaus, Elijah and Rebekah": " Nibekjah3X09.gif\n",
   "Elijah and Kol": " TO-S4-Elijah and Kol.gif\n",
   "Elijah and Finn": " Giphy (10).gif\n",
   "Klaus and Finn": " Images-33.jpeg\n",
   "Rebekah and Kol": " TO-S4-Rebekah and Kol.gif\n",
   "Klaus and Kol": " TO-S5-Klaus and Kol.gif\n",
   "Esther and Elijah": " Normal 001x003.jpg\n",
   "Esther and Finn": " tumblr_nuj6eyK9T81us10ipo7_r1_400.gif\n",
   "Rebekah and Esther": "Tumblr m3l69nNVgf1qh8sy3o4 250.gif \n",
   "Mikael and Rebekah": " Mikbekah.gif\n",
   "Mikael and Esther": " mesther.gif\n",
   "Klaus and Esther": " Normal originals222 01612klausesther.jpg\n",
   "Kol and Finn": " Tumblr o3l1z76dt21sa0lndo1 500.gif\n",
   "Marcel and Camille": "Camircelmblr ne2iknty8s1rz4iizo6 r1 250.gif\n",
   "Klaus and Marcel": " TO-S4-Klaus and Marcel.gif\n",
   "Klaus and Camille": " TO-S4-Klaus and Camille.gif\n",
   "Elijah and Sophie": " Elijah_sophie_1x06.gif\n",
   "Klaus and Sophie": " Klaus_sophie.gif\n",
   "Elijah and Hayley": " TO-S4-Elijah and Hayley.gif\n",
   "Kol and Esther": " estherkol.gif\n",
   "Jane-Anne and Sophie": " Jane-Sophie.jpg",
   "Elijah and Mikael": " Tumblr n9aqq2Xpey1qheg26o5 250.gif\n",
   "Rebekah and Marcel": " TO-S4-Rebekah and Marcel.gif\n",
   "Marcel and Davina": " TO-S4-Marcel and Davina.gif\n",
   "Elijah and Marcel": " TO-S4-Elijah and Marcel.gif\n",
   "Elijah and Camille": " Tumblr nijqz7KB9y1ribru4o2 500.gif\n",
   "Rebekah and Hayley": " Rebekah_and_Hayley.gif\n",
   "Rebekah and Sophie": " Rebekahsophie22.jpg\n",
   "Klaus and Davina": " TO-S4-Klaus and Davina.gif\n",
   "Elijah and Davina": " Originals-1x04-daggered.png\n",
   "Marcel and Sophie": " Marcel and Sophie TO 1x05.jpg\n",
   "Rebekah and Davina": " Revina2x22.gif\n",
   "Marcel and Thierry": " Marcel_thierry.gif\n",
   "Davina and Camille": " Davihugs.gif\n",
   "Klaus and Kieran": " Tumblr n4gtcpLHsv1rxl507o2 1280.jpg\n",
   "Davina and Josh": " TO-S4-Davina and Josh.gif\n",
   "Camille and Kieran": " -the-originals- 1x17-15.jpg",
   "Hayley and Sophie": " hayleysophie.gif\n",
   "Rebekah and Thierry": " Thierryrebekah.jpg\n",
   "Klaus and Josh": " Klaus and Josh 2 TO 1x03.jpg\n",
   "Elijah and Celeste": " Celijah2.png\n",
   "Hayley and Jackson": " HAJK.gif\n",
   "Klaus and Genevieve": " Klenmobs4.gif\n",
   "Celeste and Genevieve": "Gen_and_celes.jpg\n",
   "Hayley and Celeste": " Hayley-Elijah and Celeste 1x15.png",
   "Rebekah and Genevieve": " LongWayHell14.jpg\n"
  },
  "caption1": {
   "_not_set_in": 49,
   "_set_in": 0
  },
  "name": {
   "_not_set_in": 21,
   "_set_in": 28,
   "Mikael and Klaus": " Klaus and Mikael\n",
   "Elijah and Kol": " Elijah and Kol\n",
   "Esther and Elijah": " Esther and Elijah \n",
   "Esther and Finn": " Esther and Finn\n",
   "Rebekah and Esther": " Rebekah and Esther\n",
   "Mikael and Rebekah": " Mikael and Rebekah\n",
   "Mikael and Esther": " Mikael and Esther\n",
   "Klaus and Esther": " Klaus and Esther",
   "Marcel and Camille": " Marcel and Camille\n",
   "Elijah and Sophie": " Elijah and Sophie\n",
   "Klaus and Sophie": " Klaus and Sophie\n",
   "Jane-Anne and Sophie": " Jane-Anne and Sophie\n",
   "Elijah and Mikael": " Elijah and Mikael\n",
   "Rebekah and Marcel": " Rebekah and Marcel\n",
   "Elijah and Camille": " Elijah and Camille\n",
   "Rebekah and Hayley": " Rebekah and Hayley\n",
   "Rebekah and Sophie": " Rebekah and Sophie\n",
   "Marcel and Sophie": " Marcel and Sophie\n",
   "Marcel and Thierry": " Marcel and Thierry\n",
   "Davina and Josh": " Davina and Josh\n",
   "Camille and Kieran": " Camille and Kieran\n",
   "Hayley and Sophie": " Hayley and Sophie\n",
   "Rebekah and Thierry": " Rebekah and Thierry\n",
   "Klaus and Josh": " Klaus and Josh\n",
   "Klaus and Genevieve": " Klaus and Genevieve\n",
   "Celeste and Genevieve": " Celeste and Genevieve\n",
   "Hayley and Celeste": " Hayley and Celeste\n",
   "Rebekah and Genevieve": " Rebekah and Genevieve\n"
  },
  "nickname(s)": {
   "_not_set_in": 13,
   "_set_in": 36,
   "Mikael and Klaus": " Miklaus\n",
   "Klaus and Rebekah": " Klebekah\n",
   "Elijah and Rebekah": " Elibekah, Relijah\n",
   "Klaus, Elijah and Rebekah": " Nibekjah\n",
   "Elijah and Kol": " Kolijah",
   "Elijah and Finn": " Filijah\n",
   "Klaus and Finn": " Klinn, Flaus\n",
   "Rebekah and Kol": " Rebekol, Kolbekah\n",
   "Klaus and Kol": " Kolaus or Klol\n",
   "Esther and Finn": " Festher\n",
   "Rebekah and Esther": " Rebesther\n",
   "Mikael and Rebekah": " Mikbekah\n",
   "Mikael and Esther": " Mesther\n",
   "Kol and Finn": " Kolinn, Kinn, Fol",
   "Marcel and Camille": " Marcille, Carcel, Mami, Camcel\n",
   "Klaus and Marcel": " Klarcel, Nicellus\n",
   "Klaus and Camille": " Klamille, Klami\n",
   "Elijah and Sophie": " Solijah\n",
   "Klaus and Sophie": " Klophie\n",
   "Elijah and Hayley": " Haylijah\n",
   "Jane-Anne and Sophie": " Janophie,The Deveraux Sisters\n",
   "Elijah and Mikael": " Miklijah, Elikael\n",
   "Rebekah and Marcel": " Rebel, Marbekah\n",
   "Marcel and Davina": " Darcel, Marvina\n",
   "Elijah and Marcel": " Elicel, Melijah\n",
   "Elijah and Camille": " Camlijah\n",
   "Rebekah and Hayley": " Haybekah, Rayley\n",
   "Rebekah and Sophie": " Rophie, Sobekah\n",
   "Klaus and Davina": " Klavina",
   "Rebekah and Davina": " Revina\n",
   "Davina and Camille": " Daville, Camina\n",
   "Davina and Josh": " Javina or Jovina\n",
   "Hayley and Sophie": " Sayley\n",
   "Rebekah and Thierry": " Thebekah\n",
   "Hayley and Jackson": " Jayley, Hayson",
   "Klaus and Genevieve": " Klenevieve\n"
  },
  "intimacy levels": {
   "_not_set_in": 0,
   "_set_in": 49,
   "Mikael and Klaus": " Step-Father/Step-Son; Enemies, Mikael hated Klaus, Klaus sought Mikael's approval but grew to hate Mikael (even then he still wanted his step-father’s love and approval). Mikael hunted Klaus down for centuries until he was finally killed, Klaus killed his [[Esther Mikaelson|mother]] and blamed it on Mikael, Klaus despised Mikael, Klaus killed Mikael twice.\n",
   "Klaus and Rebekah": " Half-Siblings, Family Bond; Love Each Other, Former Allies, Former Enemies; Klaus was protective over Rebekah as an older brother, Protective of each other, Klaus gave his child into Rebekah's care and to protect his child, Klaus bears no more ill will to his half-sister and genuinely wishes Rebekah happiness, Their relationship was strained throughout the series but now is mended, They have mended their broken bond and stand together against those who want to destroy them, They have been separated for several years due to a piece each of the  Hollow’s soul residing in them, Klaus decided to spend his last moments with Rebekah and the rest of their family.\n",
   "Elijah and Rebekah": " Close Siblings, Love each other, They care about each other, Former Allies; Elijah was protective over Rebekah in an older sibling-way, They shared a strong bond, They were protective of each other.\n",
   "Klaus, Elijah and Rebekah": " Family, Strong Sibling Relationship; Former Allies, Former Enemies; [[Elijah and Klaus]] were estranged but are now allies again, Despite their internal feuds they always stand by each other whenever they face any threat, The birth of [[Hope Mikaelson|Hope]] has brought this group of the family to work together.",
   "Elijah and Kol": " Siblings <small>(Strained Relationship)</small>, Former Allies/Enemies; They have always cared about each other because they are family despite not always being on good terms, Elijah thought Kol was too reckless and was a bad influence on [[Niklaus Mikaelson|Klaus]], They cared about each other, Kol was mad at Elijah for choosing to sacrifice [[Davina Claire|Davina]] to kill [[Lucien Castle|Lucien]] and it appears he has not forgiven him for it entirely.\n",
   "Elijah and Finn": " Brothers, Former Allies, Former Enemies; They grew to care about each other again before Finn's final death, Finn despised Elijah for not undaggering him for 900 years, Elijah saw Finn as a threat for their family because of his self-loathing.\n",
   "Klaus and Finn": " Were Family, Half-Brothers; Former Enemies/Allies; Klaus kept Finn neutralized for 900 years, Finn hated Klaus for what he did to him, Klaus hated Finn in return for helping [[Esther Mikaelson|their mother]] to try to kill him/[[Elijah Mikaelson|their]] [[Rebekah and Kol|siblings]] <small>(for trying to kill his daughter [[Hope Mikaelson|Hope]])</small>, Klaus promised to avenge Finn's death (which somewhat affected their relationship in a positive way before Finn’s death).",
   "Rebekah and Kol": " Family, Close Siblings; Former Partners in crime, Allies, Former Frenemies/Enemies; Care about one another, Protective of each other, Love each other, Both have vowed to help each other, Rebekah vowed to help resurrect Kol (from his third death), Rebekah would have stopped at nothing to bring Kol back from the dead, Kol knows that Rebekah didn't give up on him, They used to be separated because [[the Hollow]]'s pieces of her soul were inside them.\n",
   "Klaus and Kol": " Family, Close half-brothers; Frenemies (from time to time), Former Enemies/Allies; They liked to tease each other, They liked to drink and have fun together, They both liked to be the alpha male, They weren’t afraid of each other, They cared about each other, They protected and love each other, Kol is the only one who has never been afraid of Klaus, Even though they may fight and argue they still have a strong bond, Kol helped save his brother from Marcel, Despite fighting over Kol's reluctant betrayal Klaus finally understood Kol's reasons and set his brother free, before Klaus’ death he admitted that he secretly adores Kol.\n",
   "Esther and Elijah": " Were Family, Mother and Son; Former Allies, Former Enemies; Esther tried to kill Elijah and his siblings, Elijah no longer considers Esther his mother, Esther tortured Elijah about [[Tatia]], Elijah swapped the ashes of Kol for Esther in Davina's resurrection (in an attempt of the ressurection of Kol) in order to obtain her blood to kill Dahlia, Esther sacrificed herself to save Elijah and his siblings in the final battle against [[Dahlia]].",
   "Esther and Finn": " Mother/Son, Former Close Bond; \nFormer Allies, Enemies; He stood by her through everything and was the \"sacrificial lamb\" for her, He hated her for becoming a [[vampire]] instead of rejecting the transition into one.",
   "Rebekah and Esther": " Were Family, Mother and Daughter, Former close bond; Former Allies, Former Enemies; Rebekah mourned Esther's first death, Esther watched over her as a ghost while Rebekah missed her all those years, Esther tried to kill Rebekah and her siblings, Rebekah sired Esther in a [[Lenore|host body]], Esther sacrificed her life to save Rebekah and her siblings in their final fight against [[Dahlia]].\n",
   "Mikael and Rebekah": " Were Family, Father/Daughter relationship; Former Frenemies/Enemies; Rebekah is Mikael's second favorite child, Mikael recognized his [[Rebekah Mikaelson|daughter]] even in [[Eva Sinclair|another body]], Mikael is dead now and Rebekah mourns him.\n",
   "Mikael and Esther": " Were Married, Loved each other, Sexual; Former Allies, Former Enemies; Esther chose Mikael over her sister [[Dahlia]] (centuries ago), Mikael tried to avenge Esther’s death by chasing Klaus and the rest of his children for nearly a thousand years, They had [[Mikaelson Family|children]] together, Their relationship deteriorated gradually after [[Freya Mikaelson|Freya's]] \"death\" (centuries ago), They shared a tense reunion while Esther was possessing [[Lenore]]'s body. \n",
   "Klaus and Esther": " Were Family, Mother/Son relationship; Former close relationship, Former Allies/Enemies; Klaus killed Esther centuries ago and blamed [[Mikael]] for her death, Esther felt that she made a mistake by making Klaus and the rest of his half-siblings [[vampire]]s, Klaus resents Esther and feels that she weakened him his whole life, Klaus was unwilling to forgive Esther after she begged him to do so many times, Esther lied to Klaus about his true heritage and biological [[Ansel|father]], Esther sacrificed her life to save Klaus and his half-siblings during their final fight against [[Dahlia]].\n",
   "Kol and Finn": " Brothers, Former Allies, Former Enemies; Kol was working against Finn, Finn killed Kol, They both were resurrected into new bodies by their [[Esther Mikaelson|mother]], Kol hates Finn for killing him and wanted to kill him, Kol mourns his death even though he hates Finn.",
   "Marcel and Camille": " Ex-Fling, Sexual; Good Friends, Former Frenemies, Former Allies; They cared about each other, They were protective of each other, Marcel is currently grieving Cami’s death.",
   "Klaus and Marcel": " Family (Father/Son Relationship), Former Mentor/Student, Klaus adopted Marcel when he was a human kid, Strong Bond; They would have done anything to protect each other, They loved each other as family, Klaus was the only father Marcel ever knew; Best Friends, Former Allies/Frenemies,/Enemies; Marcel blamed Klaus' family and him for [[Davina Claire]]'s death (disregarding the fact that Klaus had nothing to do with Davina's death), Marcel had denounced their friendship, Marcel [[Papa Tunde's Blade|daggered]] Klaus for several years as revenge for Davina's death, They seemingly made up before Klaus’ death.\n",
   "Klaus and Camille": " Close Friends, Former Lovers, Former Frenemies, Former Enemies, Former Allies; Kissed, They were in love, Cami brought out Klaus' humanity, They were protective of each other, Klaus called Cami his therapist, Cami helped to take care of [[Hope Mikaelson|his then-baby daughter]], They have both saved each other in the past, Klaus promised Cami that he will carry her memory forever.",
   "Elijah and Sophie": " Frenemies, Former Allies, Former Enemies; Elijah saved Sophie’s life years ago, They worked together against the Mikaelsons' enemies.",
   "Klaus and Sophie": " Frenemies, Former Allies/Enemies; They have both manipulated each other at a certain point, Sophie worked with him to deal with [[Hope Mikaelson|Hope's]] situation, Sophie stabbed him and gained a more antagonistic relationship with him before she was killed by her niece.",
   "Elijah and Hayley": " Former Lovers, Sexual; They were in love with each other, They couldn't be together romantically because Hayley was married to [[Jackson Kenner|Jackson]]; Hayley chose to be with Elijah in the end (despite her promises not to be because of Jackson); They were family through Hope, Elijah was the uncle of Hayley's daughter (he was compelled to forget so); They had each other's backs in tough situations, Elijah was originally compelled to forget about his [[Mikaelson Family|family]] (which included Hayley), Elijah remembers Hayley and feels guilty for her death.\n",
   "Kol and Esther": " Were Family, Mother and Son; Enemies, Former Allies <small>(Esther resurrected Kol)</small>, Kol turned against [[Esther and Finn|her and Finn]]\n",
   "Jane-Anne and Sophie": " Sisters, Former Allies; They loved each other, They were protective of each other, Sophie mourned Jane-Ann’s loss, Sophie tried to support [[Monique Deveraux|Monique]] during the [[The Harvest|Harvest]] in order to carry on Jane-Ann's wishes of protecting her child (Sophie's niece).\n",
   "Elijah and Mikael": " Were Family, Father and Son; Former Allies/Enemies; Mikael has tried numerous times to turn Elijah against Klaus, Elijah spent the majority of his life running from Mikael, Mikael tried to kill Elijah after he was brought back to life, (Despite all this, he has said that Elijah is a son he could be proud of, unlike Klaus).\n",
   "Rebekah and Marcel": " Engaged, In love; Like family, Rebekah was originally Marcel's  adoptive aunt (when he was a child); Love Each Other, Sexual; Allies, Close Bond; Marcel chose [[Niklaus Mikaelson|Klaus]] over Rebekah (originally), Rebekah moved to New York where Marcel joined her to start their relationship again, Marcel chose Rebekah over New Orleans and eventually wanted to marry her, Rebekah eventually accepted to marry Marcel.\n",
   "Marcel and Davina": " Are Family now <small>(They are technically family now being they are both family to Hope Mikaelson)</small>, Father/Daughter-like relationship; They love each other, Care about one another, Protective of each other; Best Friends, Allies; Marcel would do anything to protect Davina, Marcel greatly mourned her loss when Davina was killed (both times).",
   "Elijah and Marcel": " Were Family, Adoptive Uncle/Nephew (Elijah/Marcel); Ex-Good Friends (Currently Frenemies), Former Allies/Enemies; They were partners, Elijah betrayed Marcel by letting [[Freya Mikaelson]] use [[Davina Claire]] in a spell, Elijah killed Marcel (as a vampire), Marcel bit Elijah infecting him with an incurable wound as revenge for killing him.\n",
   "Elijah and Camille": " Friends, Former Allies; They shared a mutual respect, Elijah saw that Cami brought out the humanity in [[Niklaus Mikaelson|Klaus]], They bonded together when Klaus asked them to stay with Hope",
   "Rebekah and Hayley": " Were Family <small>(Family Bond by Hope)</small>, Like Sisters; Good Friends, Former Allies, Former Frenemies; Rebekah is the aunt and former guardian of Hayley's child (Hope), Hayley tells Klaus that she loves Rebekah too, Protective of each other, Hayley spent five years looking for cures for Rebekah and their family.",
   "Rebekah and Sophie": " Former Allies, Former Enemies, Frenemies; They both helped [[Hope Mikaelson|Hope]] come into the world (Sophie for her own benefit)\n",
   "Klaus and Davina": " In-Laws <small>(Klaus’ half-brother Kol married Davina)</small>; Frenemies, Former Enemies/Allies; Klaus killed Davina’s [[Timothy|friend]], Davina wanted to kill/dagger Klaus years ago, Klaus took part in fooling Davina into resurrecting his [[Esther Mikaelson|mother]] instead of Kol, Klaus used Davina constantly, Davina hates Klaus and was willing to use the [[witch]]es against him if he ever messed with them again <small>(before losing her title as [[Regent]])</small>, Davina broke Klaus’ [[Sirelines|sireline]] (which only worsened their hostile relationship), Klaus was upset to learn that his siblings sacrificed Davina to the Ancestors, Davina tried to sacrifice Klaus’ life to lock the Hollow but failed.\n",
   "Elijah and Davina": " Family, In-Laws; Ex-Friends, Former Allies/Frenemies/Enemies; They used to hold a mutual respect for each other (Davina despised Elijah), Their friendship was strained due to Davina feeling betrayed by Elijah, [[Elijah Mikaelson|Elijah]] cared about Davina before using her as a sacrifice, Elijah used Davina’s soul to kill [[Lucien Castle]] and was partly responsible for her initial demise.",
   "Marcel and Sophie": " Sexual, Ex-Fling; Former Allies, Enemies; Marcel killed Sophie’s [[Jane-Anne Devereux|sister]] (which ruined their relationship), They were both allies against the [[The Harvest|Harvest]].",
   "Rebekah and Davina": " Family, Sister-in-Laws; Former Friends, Former Allies/Enemies; Rebekah sees herself in Davina, Rebekah cares about her, Rebekah saved her life from [[Niklaus Mikaelson|Klaus Mikaelson]], Davina liked only Rebekah out of all the Mikaelson siblings before she betrayed her, Davina despised Rebekah because she violated her promise to help resurrect Kol.\n",
   "Marcel and Thierry": " Best Friends <small>(Strained Relationship)</small>, Former Allies, Former Enemies; Marcel sired Thierry decades ago, Marcel saved Thierry's life before turning him into a vampire, Thierry was manipulated to betray Marcel (and it worked), Marcel sent Thierry to a [[The Garden|vampire-prison]] as punishment for betraying him.\n",
   "Davina and Camille": " Friends, Former Allies; They worked together to stop outside enemies from hurting their friends, They cared about each other, Davina freed Cami from [[Niklaus Mikaelson|Klaus']] [[Mind Compulsion|compulsion]], Davina attempted to save Camille's life.\n",
   "Klaus and Kieran": " Friends, Former Allies; Kieran was sired by Klaus as a vampire, Klaus tried to save Kieran’s life before he died, Klaus grew to respect Kiernan before the man’s death, They both cared about Cami’s safety.",
   "Davina and Josh": " Best Friends, Former Allies, Like Siblings; Cared about each other, They were protective of each other, Would have done anything for each other, They love each other like siblings, Davina wished Josh a good life (before departing from New Orleans with Kol), Josh used to always bring flowers to put on Davina’s grave before she was resurrected (for the second time), They shared a distant friendship being Davina moved to California with her husband, Davina is grieving Josh’s loss.\n",
   "Camille and Kieran": " Family, Uncle/Niece, Former Allies; They had a close familial relationship, Kiernan took care of Cami, Cami had trouble trusting Kiernan before he died because he kept the supernatural world a secret to her.\n",
   "Hayley and Sophie": " Frenemies, Former Enemies/Allies; Sophie used Hayley and her pregnancy numerous times to get to [[Niklaus Mikaelson|Klaus Mikaelson]] (which fueled their antagonistic relationship), They disliked each other.",
   "Rebekah and Thierry": " Former Allies, Frenemies; They worked together, Thierry betrayed Rebekah by leaving her to fend for herself in the hands of [[Papa Tunde]], Rebekah believed that Thierry was a coward for leaving her in Papa Tunde’s hands.",
   "Klaus and Josh": " Former Allies (Compelled by Klaus), Former Enemies, Frenemies; Josh was terrified of Klaus, Josh hated Klaus for using him as a messenger, Josh betrayed him by siding with [[Marcel Gerard]] against Klaus (this is seemingly forgiven however), Klaus attempted to kill Josh in order to get Hayley back (in the fifth season).",
   "Elijah and Celeste": " Ex-lovers, Sexual, They were in love decades ago; Former Allies, Enemies; Celeste was the second woman Elijah fell in love with during his centuries of living, Celeste hated Elijah for choosing [[Niklaus Mikaelson|Klaus Mikaelson]] (her first killer) over her, Elijah killed her a second time for harming his family.\n",
   "Hayley and Jackson": " Were Married (Arranged Marriage at first), Sexual; Good Friends, Former Allies; Were attracted to one another, Were protective of each other, They loved each other, Jackson loved Hope as his own daughter too, Jackson recognized Hayley held complicated feelings for [[Elijah Mikaelson|Elijah]], Hayley promised to stay by Jackson and that she would always choose him, Jackson knew that Hayley is in love with Elijah and had known since their wedding, Hayley was mourning Jackson's death by killing all those in [[The Strix|the Strix]] responsible for his execution (she fulfilled her goals).\n",
   "Klaus and Genevieve": " Ex-Lovers, Sexual, They had mutual use of each other (both as allies and sexually); Former Allies, Enemies; Genevieve tried to kill [[Hope Mikaelson|Klaus’ daughter]], Genevieve doubted Klaus’ feelings for her (Klaus even hinted that he may have cared about her when she asked him if he did truly care about her.).",
   "Celeste and Genevieve": " Friends, Former Allies; Céleste considered her a friend, It is unknown if Genevieve knew that Celeste possessed her good friend Clara (decades ago).",
   "Hayley and Celeste": " Enemies, Former Allies; Celeste put [[the Crescent Curse]] on Hayley's family decades ago (she also removed it), Celeste tried to kill Hayley’s family and her in modern day.\n",
   "Rebekah and Genevieve": " Ex-Friends, Former Allies (with [[Marcel Gerard|Marcel]]), Enemies; Genevieve felt used by Rebekah and [[Marcel Gerard|Marcel]], Rebekah is partly responsible for Genevieve dying from the influenza, Genevieve hates Rebekah.\n"
  },
  "first met": {
   "_not_set_in": 0,
   "_set_in": 49,
   "Mikael and Klaus": " The day [[Niklaus Mikaelson|Klaus]] was born.\n",
   "Klaus and Rebekah": " The day [[Rebekah Mikaelson|Rebekah]] was born\n",
   "Elijah and Rebekah": " When [[Rebekah Mikaelson|Rebekah]] was born.\n",
   "Klaus, Elijah and Rebekah": " *Klaus' birth <small>(Elijah)</small>\n*Rebekah's birth <small>([[Elijah and Klaus]])</small>\n",
   "Elijah and Kol": " The day [[Kol Mikaelson|Kol]] was born\n",
   "Elijah and Finn": " When [[Elijah Mikaelson|Elijah]] was born\n",
   "Klaus and Finn": " When Klaus was born\n",
   "Rebekah and Kol": " When [[Rebekah Mikaelson|Rebekah]] was born.\n",
   "Klaus and Kol": " When [[Kol Mikaelson|Kol]] was born.\n",
   "Esther and Elijah": " When Elijah was born\n",
   "Esther and Finn": " When Finn was born\n",
   "Rebekah and Esther": " When Rebekah was born\n",
   "Mikael and Rebekah": " [[Rebekah Mikaelson|Rebekah]]'s birth.\n",
   "Mikael and Esther": " [[Timeline|10th Century]]\n",
   "Klaus and Esther": " When Niklaus was born\n",
   "Kol and Finn": " The day [[Kol Mikaelson|Kol]] was born\n",
   "Marcel and Camille": " May 2011 (''[[The Originals (Episode)|The Originals]]'')\n",
   "Klaus and Marcel": " 1820 (''[[A Closer Walk With Thee]]'')\n",
   "Klaus and Camille": " April 2011 (''[[The Originals (Episode)|The Originals]]'')\n",
   "Elijah and Sophie": " Season One of ''[[The Originals (Episode)|The Originals]]''\n",
   "Klaus and Sophie": " ''[[The Originals (Episode)|The Originals]]''\n",
   "Elijah and Hayley": " ''[[Always and Forever]]''\n",
   "Kol and Esther": " Kol's birth\n",
   "Jane-Anne and Sophie": " When Sophie was born\n",
   "Elijah and Mikael": " The day Elijah was born\n",
   "Rebekah and Marcel": " 1810",
   "Marcel and Davina": " 8 months before Season One\n",
   "Elijah and Marcel": " 1820\n",
   "Elijah and Camille": " ''[[Always and Forever]]''\n",
   "Rebekah and Hayley": " September, 2011 (''[[House of the Rising Son]]'')\n",
   "Rebekah and Sophie": " ''[[House of the Rising Son]]''\n",
   "Klaus and Davina": " ''[[Girl in New Orleans]]''\n",
   "Elijah and Davina": " ''[[Girl in New Orleans]]''\n",
   "Marcel and Sophie": " 8 months prior to the series, in New Orleans\n",
   "Rebekah and Davina": " 2011 (''[[House of the Rising Son]]'')\n",
   "Marcel and Thierry": " 1940's\n",
   "Davina and Camille": " ''[[Girl in New Orleans]]''\n",
   "Klaus and Kieran": " 2011 (''[[Fruit of the Poisoned Tree]]'')\n",
   "Davina and Josh": " Late 2011 <small>(''[[Bloodletting]]'')</small>\n",
   "Camille and Kieran": " When Camille was born",
   "Hayley and Sophie": " ''[[The Originals (Episode)|The Originals]]''\n",
   "Rebekah and Thierry": " Season 1 of ''[[The Originals]]''\n",
   "Klaus and Josh": " Late 2011 <small>(''[[House of the Rising Son]]'')</small>\n",
   "Elijah and Celeste": " [[Timeline|Early 19th Century]]\n",
   "Hayley and Jackson": " [[Tangled Up In Blue|September 2011]]\n",
   "Klaus and Genevieve": " ''[[Long Way Back From Hell]]''\n",
   "Celeste and Genevieve": " Early 20th Century \n",
   "Hayley and Celeste": " ''[[Tangled Up In Blue]]''\n",
   "Rebekah and Genevieve": " 1919\n"
  },
  "started dating": {
   "_not_set_in": 42,
   "_set_in": 7,
   "Mikael and Esther": " [[Timeline|10th Century]]",
   "Kol and Finn": "\n",
   "Marcel and Camille": " September 2011 (''[[House of the Rising Son]]'')\n",
   "Elijah and Hayley": " ''[[Give 'Em Hell Kid]]''",
   "Rebekah and Marcel": " Decades Ago\n",
   "Elijah and Celeste": " [[Timeline|Early 19th Century]]\n",
   "Klaus and Genevieve": " ''[[Moon Over Bourbon Street]]''\n"
  },
  "status": {
   "_not_set_in": 0,
   "_set_in": 49,
   "Mikael and Klaus": " Were Family, Enemies; Ended <small>(Both are dead)</small>",
   "Klaus and Rebekah": " Half-Siblings, Close Family Bond, Former Allies, Ended <small>(Klaus is dead)</small>",
   "Elijah and Rebekah": " Siblings, Former Allies; Ended <small>(Elijah is dead)</small>",
   "Klaus, Elijah and Rebekah": " Siblings, Former Allies/Enemies; Ended <small>(Elijah and Klaus are dead)</small>\n",
   "Elijah and Kol": " Brothers, Former Allies; Ended <small>(Elijah is dead)</small>\n",
   "Elijah and Finn": " Brothers, Former Enemies, Former Allies; Ended <small>(Both are dead)</small>",
   "Klaus and Finn": " Were Family, Half-Brothers, Former Enemies; Ended <small>(Both are dead)</small>\n",
   "Rebekah and Kol": " Close Siblings, Allies\n",
   "Klaus and Kol": " Family, Close Half-Brothers, Former Allies; Ended <small>(Klaus is dead)</small>",
   "Esther and Elijah": " Were Family, Mother and Son; Former Enemies; Ended <small>(Both are dead)</small>\n",
   "Esther and Finn": " Mother/Son, Enemies; Ended; <small>(She died again)</small>\n",
   "Rebekah and Esther": " Daughter/Mother, Were Family, Frenemies; Ended <small>(Esther is dead)</small>",
   "Mikael and Rebekah": " Were Family, Former Frenemies/Enemies; Ended <small>(Mikael is dead)</small>",
   "Mikael and Esther": " Were Married, Former Allies, Former Enemies; Ended <small>(Both are dead) </small>\n",
   "Klaus and Esther": " Were Family; Former Allies/Enemies; Ended <small>(Both are dead)</small>",
   "Kol and Finn": " Brothers, Former Allies, Former Enemies; Ended <small>(Finn is dead)</small>\n",
   "Marcel and Camille": " Ex-Fling, Good Friends, Former Allies; Ended <small>(Cami is dead)</small>\n",
   "Klaus and Marcel": " Were Family, Best Friends/Frenemies, Former Enemies/Allies; Ended <small>(Klaus is dead)</small>",
   "Klaus and Camille": " Close Friends, Former Lovers; Ended <small>(Both are dead)</small>\n",
   "Elijah and Sophie": " Former Allies, Frenemies; Ended <small>(Both are dead)</small>\n",
   "Klaus and Sophie": " Frenemies, Former Allies/Enemies; Ended <small>(Both are dead)</small>",
   "Elijah and Hayley": " Former Lovers, Former Allies; Ended <small>(Both are dead.)</small>\n",
   "Kol and Esther": " Mother and Son, Enemies; Ended <small>(Esther is dead)</small>\n",
   "Jane-Anne and Sophie": " Sisters, Former Allies; Ended <small>(Both are dead)</small>",
   "Elijah and Mikael": " Were Family, Father/Son, Former Enemies; Ended <small>(Both are dead)</small>",
   "Rebekah and Marcel": " Fiancés, Allies\n",
   "Marcel and Davina": " Family, Best Friends, Allies\n",
   "Elijah and Marcel": " Were Family, Adoptive Uncle/Nephew; Ex-Friends, Frenemies, Former Allies/Enemies; Ended <small>(Elijah is dead)</small>",
   "Elijah and Camille": " Friends, Former Allies; Ended <small>(Both are dead) </small>\n",
   "Rebekah and Hayley": " Were Family, Good Friends, Former Allies; Ended <small>(Hayley is dead)</small> \n",
   "Rebekah and Sophie": " Former Allies, Frenemies; Ended <small>(Sophie is dead)</small>",
   "Klaus and Davina": " Frenemies, Former Enemies/Allies; In-Laws; Ended <small>(Klaus is dead)</small>\n",
   "Elijah and Davina": " Family, In-laws; Ex-Friends, Frenemies/Enemies; Ended <small>(Elijah is dead)</small>",
   "Marcel and Sophie": " Enemies, Ex-Fling; Ended <small>(Sophie is dead)</small>\n",
   "Rebekah and Davina": " Family, Sister-in-Laws, Former Friends, Former Allies/Enemies",
   "Marcel and Thierry": " Best Friends <small>(Strained)</small>, Former Allies, Former Enemies; Ended <small>(Thierry is dead)</small>",
   "Davina and Camille": " Friends, Former Allies; Ended <small>(Cami is dead)</small>",
   "Klaus and Kieran": " Former Allies; Friends; Ended <small>(Both are dead)</small>\n",
   "Davina and Josh": " Best Friends, Former Allies; Ended <small>(Josh is dead)</small>",
   "Camille and Kieran": " Family, Uncle/Niece, Former Allies; Ended <small>(Both are dead)</small>\n",
   "Hayley and Sophie": " Former Allies, Former Enemies, Frenemies; Ended <small>(Both are dead)</small>\n",
   "Rebekah and Thierry": " Former Allies, Frenemies; Ended <small>(Thierry is dead)</small>\n",
   "Klaus and Josh": "  Frenemies; Ended <small>(Both are dead)</small>\n",
   "Elijah and Celeste": " Ex-lovers, Enemies; Ended <small>(Both are dead)</small>",
   "Hayley and Jackson": " Former Husband/Wife, Good Friends/Former Allies; Reunited <small>(Both are found the same peace with each other.)</small>\n",
   "Klaus and Genevieve": " Ex-Lovers, Former Allies, Enemies; Ended <small>(Both are dead)</small>\n",
   "Celeste and Genevieve": " Friends, Former Allies; Ended <small>(Both are dead)</small>\n",
   "Hayley and Celeste": " Former Allies/Enemies; Ended <small>(Both are dead)</small>\n",
   "Rebekah and Genevieve": " Ex-Friends, Former Allies, Enemies; Ended <small>(Genevieve is dead)</small>"
  }
 }
}